src/main/resources/xml/accommodationFulfillmentComponentWSPort/publishRoomReadyStatusEvent/publishRoomReadyStatusEvent.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:publishRoomReadyStatusEvent>
         <request>
            <roomReadyStatusChangeRequest>
               <messageType>?</messageType>
               <accommodationId>?</accommodationId>
               <!--Optional:-->
               <tpsId>?</tpsId>
               <partyMixCount>?</partyMixCount>
               <!--Optional:-->
               <checkinDate>?</checkinDate>
               <!--Optional:-->
               <checkoutDate>?</checkoutDate>
               <recipientDetail>
                  <!--Optional:-->
                  <email>?</email>
                  <!--Optional:-->
                  <phone>?</phone>
                  <!--Optional:-->
                  <mobilePushId>?</mobilePushId>
                  <guestFirstName>?</guestFirstName>
                  <guestLastName>?</guestLastName>
                  <transactionGuestId>?</transactionGuestId>
               </recipientDetail>
            </roomReadyStatusChangeRequest>
            <facilityId>?</facilityId>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:publishRoomReadyStatusEvent>
   </soapenv:Body>
</soapenv:Envelope>
